lib/tasks/assignment_5.rake

    task :join_all => :environment do
        puts "---------------------------------------------------------------------------------------------------------------------"
        puts "  Course ID               Course Name                     Student ID                      Student Name"
        puts "---------------------------------------------------------------------------------------------------------------------"
        hash_table = Student.joins(:courses).pluck_to_hash('courses.id','courses.course_name','students.id','students.student_name')

        puts (
            hash_table.map { |k,v|
            "#{k} : #{v} \n" }
            .sort
        )
---
SELECT courses.id, courses.course_name, students.id, students.student_name FROM "students" INNER JOIN "courses" ON "courses"."student_id" = "students"."id"
SELECT students.student_name FROM "students" INNER JOIN "courses" ON "courses"."student_id" = "students"."id"

    task :join_where, [:table_name, :column_name, :condition] => :environment do | t, args |
        puts "---------------------------------------------------------------------------------------------------------------------"
        puts "  Course ID               Course Name                     Student ID                      Student Name"
        puts "---------------------------------------------------------------------------------------------------------------------"
        hash_table = Student.joins(:courses).where("#{args.table_name}.#{args.column_name}": "#{args.condition}").pluck_to_hash('courses.id','courses.course_name','students.id','students.student_name')

        puts (
            hash_table.map { |k,v|
            "#{k} : #{v} \n" }
            .sort
        )
---
SELECT courses.id, courses.course_name, students.id, students.student_name FROM "students" INNER JOIN "courses" ON "courses"."student_id" = "students"."id" WHERE "students"."student_name" = ?  [["student_name", "ABBY BOTSFORD"]]
SELECT "students".* FROM "students" INNER JOIN "courses" ON "courses"."student_id" = "students"."id" WHERE "students"."" = ?  [["", ""]]